Courses/7370/Exams/iiitdelhi-20200223-midsem-soln.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 Sun 20:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Distributed Computing  MidSem Solutions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Mateti's Distributed Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2020-02-22 | <a href="../../">../../</a>
</div>
<div id="content">
<h1 class="title">Distributed Computing  MidSem Solutions</h1>
<blockquote>
<p>
This take-home exam permits the use of a Linux/Windows laptop/PC
running javac, g++, Eclipse, Idea, and other software development
and drawing tools. It is otherwise a traditional closed book, closed
notes exam. In particular, you are honor bound <i><b>not</b></i> to Internet
surf or access any content already existing (other than as
indicated) once you access the exam until you turnin the
answers. The primary reasons in making this a take-home are to
relieve time pressure and give you a comfortable (computing/ home)
environment. Do not give or take help from others.
</p>

<p>
Submit your <code>answers.pdf</code> as an email attachment to me.
</p>

<p>
My answers: (i) Are illustrative/ pedagogical &#x2013; may not be the best
or the shortest.  (ii) TBD Include brief commentary on how the class
performed.
</p>
</blockquote>

<ol class="org-ol">
<li>(5 points each) The following statements may or may not be (fully or
partially) valid. Explain the underlined technical terms occurring in
each statement. Explain/ discuss/ dispute the statement. It is
<i>possible</i> to write no more than, say, five, lines each, and yet
receive full score.

<ol class="org-ol">
<li>"Some philosophers may remain hungry forever.'' is a <span class="underline">safety</span>,
not <span class="underline">liveness</span>, property.  <b>Answer:</b> Our Andrews book itself
uses "bad" and "good", which cannot be defined.  Many reproduced
this as the answer; I marked it as not full-scoring.  The
crucial word-groups are {never, for-ever, always, &#x2026;} and
{eventually, will-happen, &#x2026;}.  E.g., in {"A very good property
P never happens."}  P is a safety property.</li>
<li>In the context of <span class="underline">RPC</span>, a procedure designed to be used
remotely <i>can</i> use global variables to communicate with the
caller.  <b>Answer:</b> Def of RPC: Look up in lecture notes.  Global
variables can be used if you make a provision for sending any
values updated at the server back to the clients before
accessing its value.  The standard <code>rpcgen</code> does <b>not</b> do that;
so we expect our RPCs to use <span class="underline">in</span> and <span class="underline">out</span> parameters only.</li>
<li><p>
Consider the program segment given here.  Determine <i>P</i> a
predicate that characterizes the weakest deadlock-free
precondition for the program. Also, explain how you arrived at
P.
</p>
<pre class="example">
co &lt;await x &gt;= 7 -&gt; x := x - 3&gt;
|| &lt;await x &gt;= 6 -&gt; x := x + 1&gt;
|| &lt;await x &gt;= 5 -&gt; x := x + 1&gt;
oc
</pre>
<p>
<b>Answer:</b> <code>(x &gt; 7 or x = 5)</code> You can arrive at P using whatever
you have &#x2013; does not have to be wp.  It is useful to digest a
wrong answer, e.g., x = 7.  All three await-conditions are
satisfied, and one will be chosen by the system.  Suppose x &gt;= 7
is chosen, then x becomes 4. Neither of the two remaining
await-conditions are satisfied.  So, x = 7 is not the
answer. Would x ?= 8 work?  Would x ?= 6 or 5 work?  You work it
out.  Then you have to apply the "weakest" expectation that we
required.
</p></li>

<li><p>
Compute <i>wp(S, i = 100)</i>, where S is
</p>
<pre class="example">
if i &lt; 150 then i := i + 150 else i := 100 fi

</pre>
<p>
<b>Answer:</b> Obviously, you can guess the answer quickly, but this
Q is checking if you understood the wp-mechanism.  You work it
out.
</p></li>
</ol></li>

<li>(20 points each)

<ol class="org-ol">
<li>In the distributed programming context, <code>P(m); Critical-Section;
      V(m)</code> is not starvation-free.  Give a detailed starvation
scenario. What does Morris' algorithm do to eliminate this
scenario?  <b>Answer:</b>  Straightforward.  Re-read my lecture notes.</li>

<li>Construct the <code>ssend(pid, msg)</code> and <code>srecv(pid, msg)</code> primitives
of synchronous message passing from <code>asend(pid, msg)</code> and
<code>arecv(pid, msg)</code> primitives of asynchronous message passing.</li>
<li><p>
Reconstruct the binary "tree" serialized below. List each node as
a triplet of (info integer, left-link and right-link), as usual. 
The first digit in the sequence is the offset of the root node.
</p>
<pre class="example">
marshalled sequence: 2 3 4 7 4 7 8 4 A 1 4 2 7
offsets in hex:      1 2 3 4 5 6 7 8 9 A B C D

</pre>
<p>
<b>Answer:</b> node@2 = (3, left offset 3, right offset D), node@4 =(7,
4, 6), node@7 = (8, 8, 9), node@A = (1, B, C).  Figure TBD.
</p></li>
<li><p>
The <i>Recursive Data Representation: Small Set of Integers</i> of
Hoare's CSP paper is reproduced below. Extend it to respond to a
command <code>S(1)!remove(x)</code> from S(0) that removes x from the set, if
it contains it, and does nothing if it does not.
</p>

<pre class="example">
S(i: 1 .. 100) ::
*[   n: integer; S(i-1)?has(n) --&gt; S(0)!false
 []  n: integer; S(i-1)?insert(n) --&gt;
        *[  m: integer; S(i-1)?has(m) --&gt;
             [   m &lt;=  n --&gt; S(0)!(m = n)
             []  m &gt;   n --&gt; S(i+1)!has(m)
             ]
         [] m: integer; S(i-1)?insert(m) --&gt;
             [  m &lt; n --&gt; S(i+1)!insert(n); n := m
             [] m = n --&gt;  skip
             [] m &gt; n --&gt; S(i+1)!insert(m)
 ] ] ]
</pre>
<p>
<b>Answer:</b> (Just analysis and hints.  Based on my lecture after
this exam. Solution deliberately held back.) The CSP code above
has two loops.  Recall the invariant assertions of the
loops. Outer Loop Assertion: Control stays in the outer loop
when the S(i) process is empty handed. Once the control enters
the inner loop, S(i) now holds n. It never comes out of it
(because we do not yet have a remove operation).
</p>

<p>
Placement: So, where do we place the <code>remove(x)</code>?  Within the
inner loop.  On receiving <code>remove(x)</code> if x == n, S(i) should get
out of the inner loop.  But, CSP does not have a "break out of
loop", so we introduce a Boolean b which remains true in the
inner loop until x == n, when b is set to false.  Inner Loop
Assertion - Part 1: We cannot have S(i) empty handed unless all
S(i+1 .. 100) are also empty handed.  Inner Loop Assertion -
Part 2: Values held by S(j), for j &lt; i, are less than what S(i)
holds, S(j), for j &gt; i, are either holding values greater than
what S(i) holds, or are empty-handed.
</p>

<p>
Action to be taken: Left shift.  How?  Do we
first ask S(i+1) are you empty handed?  If yes, nothing to be
done.  If no, we should ask for the value it is holding.  S(i+1)
now changed state from not-empty to empty &#x2013; so it should take
the same action.  Pause this, and let us go back to remove(x)
reception.  Why did S(i) receive it?  Because S(i-1) held a
number n less than x.
</p>

<p>
For you to finish:  Write all of the CSP code for this problem.
</p>

<p>
Gotchas: Unmatched query bangs are deadlocks.  Do not make
assumptions that were not originally present (e.g., some numbers
do not appear in the set).
</p></li>
</ol></li>

<li>(0 points) [For survey purposes only.] Please record your effort in
minutes for each of the above <del>ten</del> eight items. Other feedback you
wish to give is also welcome.</li>
</ol>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 &bull; <a href=mailto:pmateti@iiitd.ac.in>pmateti@iiitd.ac.in</a> &bull; 2020-02-22
</div>
</body>
</html>
